<template>
  <q-scrollbar
    v-show="true"
    ref="scrollbar"
    wrap-class="scrollbar__wrap"
    view-class="scrollbar__list"
  >
    <div class="block">
      <div class="french-bread">
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
      </div>
    </div>
  </q-scrollbar>
</template>
<script>
export default {};
</script>

<style lang="scss" scoped>
.scrollbar__wrap {
  background: #fff;
}

.french-bread {
  max-height: 200px;
  padding: 0 20px;

  p:first-child {
    margin-top: 0;
  }
}
</style>
