<template>
  <div>
    <div class="block">
      <q-scrollbar
        ref="scrollbar"
        wrap-class="scrollbar__wrap"
        view-class="scrollbar__list"
      >
        <div class="french-bread">
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        </div>
      </q-scrollbar>
    </div>
    <br />
    <div class="block">
      <div class="demonstration">add prop <b>:visible="true"</b></div>
      <q-scrollbar
        ref="scrollbar"
        visible
        wrap-class="scrollbar__wrap"
        view-class="scrollbar__list"
      >
        <div class="french-bread">
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        </div>
      </q-scrollbar>
    </div>
    <br />
    <div class="block">
      <div class="demonstration">add prop <b>theme="secondary"</b></div>
      <q-scrollbar
        ref="scrollbar"
        theme="secondary"
        wrap-class="scrollbar__wrap"
        view-class="scrollbar__list"
        visible
      >
        <div class="french-bread">
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
          <p>съешь ещё этих мягких французских булок, да выпей чаю</p>
        </div>
      </q-scrollbar>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.scrollbar__wrap {
  background: #fff;
}

.french-bread {
  max-height: 150px;
  padding: 0 20px;

  p:first-child {
    margin-top: 0;
  }
}
</style>
